# 데이터프레임 그룹 분석

In [9]:
import pandas as pd
import numpy as np
import seaborn as sns

## pivot method

In [10]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [12]:
# 피벗 테이블의 행 인덱스에 넣을 값, 열 인덱스에 넣을 값, 보여줄 데이터
df1.pivot('도시', '연도', '인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [13]:
df1.pivot(['지역', '도시'], '연도', '인구')

연도           2005       2010       2015
지역  도시
경상권 부산  3512547.0  3393191.0  3448737.0
수도권 서울  9762546.0  9631482.0  9904312.0
    인천        NaN   263203.0  2890451.0

## 그룹 분석

In [17]:
iris = sns.load_dataset('iris')
iris.groupby(iris.species).mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [18]:
iris.groupby(iris.species).agg(['mean', 'std'])

           sepal_length           sepal_width  ... petal_length petal_width
                   mean       std        mean  ...          std        mean       std
species                                        ...
setosa            5.006  0.352490       3.428  ...     0.173664       0.246  0.105386
versicolor        5.936  0.516171       2.770  ...     0.469911       1.326  0.197753
virginica         6.588  0.635880       2.974  ...     0.551895       2.026  0.274650

[3 rows x 8 columns]

In [19]:
np.random.seed(0)
df2 = pd.DataFrame({
    'key1': ['A', 'A', 'B', 'B', 'A'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [20]:
df2.groupby(df2.key1).sum()

      data1  data2
key1
A         8     80
B         7     70

In [21]:
df2.groupby(df2.key1)['data2'].sum()

key1
A    80
B    70
Name: data2, dtype: int64

In [22]:
df2.groupby(df2.key1).sum()

key1
A    80
B    70
Name: data2, dtype: int64

### agg() 메서드로 함수 적용

In [26]:
def peak_to_peak_ratio(x):
  return x.max() / x.min()

In [27]:
iris.groupby(iris.species).agg(peak_to_peak_ratio)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [28]:
iris.groupby(iris.species).agg(lambda x: x.max()/x.min())

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [29]:
mpg = sns.load_dataset('mpg')
mpg.head()

    mpg  cylinders  displacement  ...  model_year  origin                       name
0  18.0          8         307.0  ...          70     usa  chevrolet chevelle malibu
1  15.0          8         350.0  ...          70     usa          buick skylark 320
2  18.0          8         318.0  ...          70     usa         plymouth satellite
3  16.0          8         304.0  ...          70     usa              amc rebel sst
4  17.0          8         302.0  ...          70     usa                ford torino

[5 rows x 9 columns]

In [32]:
mpg['manufacturer'] = mpg.name.apply(lambda x: x.split()[0])
mpg.head()

    mpg  cylinders  displacement  ...  origin                       name  manufacturer
0  18.0          8         307.0  ...     usa  chevrolet chevelle malibu     chevrolet
1  15.0          8         350.0  ...     usa          buick skylark 320         buick
2  18.0          8         318.0  ...     usa         plymouth satellite      plymouth
3  16.0          8         304.0  ...     usa              amc rebel sst           amc
4  17.0          8         302.0  ...     usa                ford torino          ford

[5 rows x 10 columns]

In [35]:
mpg['model'] = mpg.name.apply(lambda x: ' '.join(x.split()[1:]))
mpg.head()

    mpg  cylinders  ...  manufacturer            model
0  18.0          8  ...     chevrolet  chevelle malibu
1  15.0          8  ...         buick      skylark 320
2  18.0          8  ...      plymouth        satellite
3  16.0          8  ...           amc        rebel sst
4  17.0          8  ...          ford           torino

[5 rows x 11 columns]

## pivot_table

In [36]:
df1.pivot('도시', '연도', '인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [37]:
df1.pivot_table('인구', '도시', '연도')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [38]:
df1.pivot_table('인구', '도시', '연도', margins=True, margins_name='합계')

연도       2005       2010       2015            합계
도시
부산  3512547.0  3393191.0  3448737.0  3.451492e+06
서울  9762546.0  9631482.0  9904312.0  9.766113e+06
인천        NaN   263203.0  2890451.0  1.576827e+06
합계  6637546.5  4429292.0  5414500.0  5.350809e+06

In [40]:
df1.pivot_table('인구', ['지역', '도시'], '연도', margins=True, margins_name='합계')

연도           2005       2010       2015            합계
지역  도시
경상권 부산  3512547.0  3393191.0  3448737.0  3.451492e+06
수도권 서울  9762546.0  9631482.0  9904312.0  9.766113e+06
    인천        NaN   263203.0  2890451.0  1.576827e+06
합계      6637546.5  4429292.0  5414500.0  5.350809e+06

## tips dataset

In [45]:
tips = sns.load_dataset('tips')
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [46]:
tips['tip_pct'] = tips.tip / tips.total_bill * 100
tips.tail()

     total_bill   tip     sex smoker   day    time  size    tip_pct
239       29.03  5.92    Male     No   Sat  Dinner     3  20.392697
240       27.18  2.00  Female    Yes   Sat  Dinner     2   7.358352
241       22.67  2.00    Male    Yes   Sat  Dinner     2   8.822232
242       17.82  1.75    Male     No   Sat  Dinner     2   9.820426
243       18.78  3.00  Female     No  Thur  Dinner     2  15.974441

In [50]:
tips.describe()

       total_bill         tip        size     tip_pct
count  244.000000  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672   16.080258
std      8.902412    1.383638    0.951100    6.107220
min      3.070000    1.000000    1.000000    3.563814
25%     13.347500    2.000000    2.000000   12.912736
50%     17.795000    2.900000    2.000000   15.476977
75%     24.127500    3.562500    3.000000   19.147549
max     50.810000   10.000000    6.000000   71.034483

In [54]:
tips.groupby(tips.sex).count()

        total_bill  tip  smoker  day  time  size  tip_pct
sex
Male           157  157     157  157   157   157      157
Female          87   87      87   87    87    87       87

In [58]:
tips.groupby('sex').count()

        total_bill  tip  smoker  day  time  size  tip_pct
sex
Male           157  157     157  157   157   157      157
Female          87   87      87   87    87    87       87

In [60]:
tips.groupby(tips['sex']).count()

        total_bill  tip  smoker  day  time  size  tip_pct
sex
Male           157  157     157  157   157   157      157
Female          87   87      87   87    87    87       87

In [61]:
# NaN 데이터가 없을때
tips.groupby('sex').size()

sex
Male      157
Female     87
dtype: int64

In [62]:
# 성별, 흡연 여부에 따른 평균 팁 비율
tips.groupby('sex').tip_pct.mean()

sex
Male      15.765055
Female    16.649074
Name: tip_pct, dtype: float64

In [63]:
tips.groupby('sex')[['tip_pct']].mean()

          tip_pct
sex
Male    15.765055
Female  16.649074

In [64]:
# 흡연 여부에 따른 평균 팁 비율
tips.groupby('smoker')[['tip_pct']].mean()

          tip_pct
smoker
Yes     16.319604
No      15.932846

In [68]:
# 성별과 흡연 여부에 따른 평균 팁 비율
tips.groupby(['sex', 'smoker'])[['tip_pct']].mean()

                 tip_pct
sex    smoker
Male   Yes     15.277118
       No      16.066872
Female Yes     18.215035
       No      15.692097

In [70]:
tips.groupby(['smoker', 'sex'])[['tip_pct']].mean()

                 tip_pct
smoker sex
Yes    Male    15.277118
       Female  18.215035
No     Male    16.066872
       Female  15.692097

In [76]:
tips.pivot_table('tip_pct', ['sex', 'smoker'])

                 tip_pct
sex    smoker
Male   Yes     15.277118
       No      16.066872
Female Yes     18.215035
       No      15.692097

In [77]:
tips.pivot_table('tip_pct', 'sex', 'smoker')

smoker        Yes         No
sex
Male    15.277118  16.066872
Female  18.215035  15.692097

In [78]:
# 요일
tips.groupby('day')[['tip_pct']].mean()

        tip_pct
day
Thur  16.127563
Fri   16.991303
Sat   15.315172
Sun   16.689729

In [79]:
# 점심/저녁 여부
tips.groupby('time')[['tip_pct']].mean()

          tip_pct
time
Lunch   16.412793
Dinner  15.951779

In [80]:
# 요일, 점심/저녁
tips.groupby(['day', 'time'])[['tip_pct']].mean()

               tip_pct
day  time
Thur Lunch   16.130074
     Dinner  15.974441
Fri  Lunch   18.876489
     Dinner  15.891611
Sat  Lunch         NaN
     Dinner  15.315172
Sun  Lunch         NaN
     Dinner  16.689729

In [81]:
tips.pivot_table('tip_pct', 'time', 'day')

day          Thur        Fri        Sat        Sun
time
Lunch   16.130074  18.876489        NaN        NaN
Dinner  15.974441  15.891611  15.315172  16.689729

In [82]:
# 요일, 시간, 인원수
tips.pivot_table('tip_pct', ['time', 'size'], 'day')

day               Thur        Fri        Sat        Sun
time   size
Lunch  1     18.172790  22.377622        NaN        NaN
       2     16.402425  18.196867        NaN        NaN
       3     14.459879  18.773467        NaN        NaN
       4     14.551515        NaN        NaN        NaN
       5     12.138869        NaN        NaN        NaN
       6     17.370592        NaN        NaN        NaN
Dinner 1           NaN        NaN  23.183197        NaN
       2     15.974441  16.265852  15.528884  18.086960
       3           NaN        NaN  15.143861  15.266238
       4           NaN  11.774956  13.828925  15.316820
       5           NaN        NaN  10.657194  15.983894
       6           NaN        NaN        NaN  10.379905

In [83]:
# 어떤 요인이 가장 크게 작용하는가
tips.groupby(['day', 'time'])[['tip_pct']].agg(lambda x: x.max()/x.min())

               tip_pct
day  time
Thur Lunch    3.650035
     Dinner   1.000000
Fri  Lunch    2.202532
     Dinner   2.544342
Sat  Lunch         NaN
     Dinner   9.140009
Sun  Lunch         NaN
     Dinner  11.949266

In [87]:
def peak2peak(x):
  return x.max()/x.min()

tips.groupby(['sex', 'smoker'])[['tip_pct']].agg(['mean', 'std', peak2peak])

                 tip_pct
                    mean       std  peak2peak
sex    smoker
Male   Yes     15.277118  9.058794  19.932154
       No      16.066872  4.184875   4.066490
Female Yes     18.215035  7.159451   7.383333
       No      15.692097  3.642118   4.448720

In [ ]:
# pivot_table 및 groupby 중 더 편한 한 가지 방식을 선택.